start_created = "Здаров, {first_name}!"
start_not_created = "И снова здрасте, {first_name}!"
start_intro = "Меня зовут Толик, и я Инвест Ботик 🥸\n" \
              "Я могу помочь тебе с отслеживанием твоего инвест портфеля(растет, падает), " \
              "чирикать тебе об изменениях " \
              "и намекать шоб я делал на твоем месте основываясь на умных ивесто-математических формулах📈📊" \
              " и вот это вот всё.."
start_currency = "В чем считать-то твой портфель будем, дружок?"
start_currency_dollar_text = 'Баксики 💵'
start_currency_euro_text = 'Евросики 💶'
start_currency_button_answer_button = 'Значит выбор пал на {currency}🤔'
start_trade_experience = 'Так, так, так а опыт трейдинга у тебя то был? ' \
                         '\nп.с. говори честно - это влияет на наше будущее с тобой.. взаимопонимание я имел ввиду.. ' \
                         'короче, ты понял как я удачно шучу.'
start_trade_experience_yes_text = 'Ясен пень 🤑'
start_trade_experience_no_text = 'Пока нет 👀'
start_trade_experience_button_answer_yes_button = 'Понял, принял - имею дело с тертым калачом 🥐' \
                                                  '\nмда, претзель есть в эмоджи, а калача нет так что будем ' \
                                                  'довольстоваться круасаном.'
start_trade_experience_button_answer_no_button = 'Супер, возможно я буду твоим первым..' \
                                                 'с кем ты сделаешь свою первую трейдинг операцию.'
start_trade_experience_recommendation_text = 'На основании твоего портфеля и состояния рынка, Я, Инвест Ботик Толик 🥸, ' \
                                             'буду давать тебе рекомендации по трейдингу и уведомлять тебя об ' \
                                             'изменениях твоего портфеля.\n(ну типа радовать по утрам там когда ' \
                                             'подзаработал или наоборот растраивать' \
                                            'что сегодня ты потерял в короткой дистанции)'
start_help_tune_portfolio_text = 'Если пожелаешь, я могу провести гайд по всему что я могу делать 🧑‍💻'
start_help_tune_portfolio_question_text = 'Подрассказать или сам разберешься?'
start_help_yes_text = 'Ну, давай'
start_help_no_text = 'Всё сам'
start_help_button_answer_yes_button = 'Окай, в первую очередь: засетапим твое портфель 💼, добавим сколько ты готов ' \
                                      'инвестировать в твоей валюте и в какие компании ты будешь инвестировать.'
start_help_button_answer_no_button = 'Делай как знаешь, хитрый заяц 🐰 \n' \
                                     'все команды через слэш(/) и поплыл 🏊‍♂️'
start_important_to_invest_text = 'ВАЖНО: Баланс "Готов инвестировать" показывает мне сумму, которую ты готов ' \
                                 'проинвестировать и в зависимости от его размера я буду лучше понимать какие советы ' \
                                 'тебе давать.\nвау, иногда и рифму могу-то сказануть.'
start_write_portfolio_command_text = 'Накалякай команду /portfolio (👈 или жмакни на неё)'


#portfolio
wait_for_portfolio = 'Имей терпение - это может занять несколько минут. \n\n' \
                     'Так сказать чем больше твое портфолио - тем больше нужно собирать по нему информацию 🤓\n'
your_portfolio = 'Твое портфолио - показывает кто ты на самом деле:\n\n'
to_invest_text = 'To invest'
total_portfolio = 'Current value:'
net_profit_button = 'Net'
total_profit_button = 'Total'
costs_button = 'Costs'
efficiency_button = '%'
amount_button = 'Кол-во'
update_button = 'Обновить'

wait_update = 'Портфолио обновляется ⏱ - может занять пару минут.'

modify_button = 'Поменять'
modify_question = 'Че менять-то будем, хлопец?'

balance_button = '✏️ Поменяем баланс'
add_stock_button = '➕ Добавим Сток'
delete_stock_button = '➖ Уберем Сток'
close_button = '❌ Рот закрой'
close_modify_menu_portfolio = 'Понял, понял - удаляюсь..\n\n' \
                    'Захочешь повторить наш разговор сначала жми или пиши: /start\n' \
                    'Захочешь взглянуть на портфолио еще раз с акутальной его оценкой: /portfolio'
close_modify_menu_nested_after_start = 'Так, ну что же - мы познакомились с функционалом ведения портфолио' \
                                       ' с чем тебя и поздравляю.\n\n' \
                                       'Остальной функционал(прогнозирование, пуши и тд) сейчас находится' \
                                       ' в режиме разработки и пока поделится и погайдить тебя по нему не могу,' \
                                       ' хотя очень бы хотел.\n\n А теперь прошу тебя сказать наколько тебе зашел сам' \
                                       ' бот на данный момент по шкале от 1-5(где 1 - безразично, а 5 очень интересно' \
                                       'и давно искал что-то подобное)? '
mark_1 = '1'
mark_2 = '2'
mark_3 = '3'
mark_4 = '4'
mark_5 = '5'

answer_on_mark = 'В любом случае - благодарю за оценку, товарищ!\n\n' \
                 'Захочешь повторить наш разговор сначала жми или пиши: /start\n' \
                 'Захочешь взглянуть на портфолио еще раз с акутальной его оценкой: /portfolio'


change_balance_text = 'Введи cимволы Стока, баланс которого ты бы хотел ИЗМЕНИТЬ (допустим у Microsoft символы' \
                      ' - "MSFT", а у битка к доллару - "BTC-USD")\n' \
                      'или если нужно поменять средства которые ты бы хотел инветсировать просто нажми кнопочку 👇'
add_stock_text = 'Введи cимволы Стока, который ты бы хотел ДОБАВИТЬ (допустим у Tesla - символы TSLA, а у битка к' \
                 ' доллару - "BTC-USD").\n' \
                 'Ну или вернись назад если ошибся этажом👇'
delete_stock_text = 'Введи cимволы Стока, который ты бы хотел УДАЛИТЬ - именно УДАЛИТЬ ❌\n' \
                    'ВАЖНО: удалишь Сток и вся информация по нему будет удалена из твоего портфолио и её нельзя' \
                    ' будет вернуть❗️\n' \
                    '(схема таже если у тебя Apple - символы AAPL, а у битка к доллару - "BTC-USD").\n' \
                    'Ну или вернись назад если ошибся этажом👇'



modify_to_invest_button = '"Готов залить" изменить'
back_to_modify_button = '🔙 Надо назад'

change_balance_text_stock_write = 'Выбрал значит такой тикет МЕНЯТЬ, хорошо'
delete_stock_write = 'Выбрал значит такой тикет УДАЛЯТЬ, хорошо'
add_stock_write = 'Выбрал значит такой тикет ДОБАВЛЯТЬ, хорошо'

modify_wrong_ticket = 'Попробуй ввести еще раз, товарищ)\nСимволы которые можно применять: a-z, A-Z, 0-9, . и -.\n' \
                      'Кол-во символов: 3-6.'
add_wrong_ticket = 'Попробуй ввести еще раз, товарищ)\nСимволы которые можно применять: a-z, A-Z, 0-9, . и -.\n' \
                      'Кол-во символов: 3-6.'
delete_wrong_ticket = 'Попробуй ввести еще раз, товарищ)\nСимволы которые можно применять: a-z, A-Z, 0-9, . и -.\n' \
                      'Кол-во символов: 3-6.'

modify_balance_stock_not_in_portfolio = 'Такого стока тикета нет в твоем портфолио или его в принципе не существует' \
                                        ', дядь..\nЕсли 1ое - то ты можешь добавить сток в предыдущем меню 🔙\n' \
                                        'Если второе, то будь впредь повнимательнее, пожалуйста'
modify_balance_stock_symbol_shares = 'У тебя в 💼 сейчас {shares} акций {symbol}.\nА сколько должно быть? (пиши цифрами' \
                                     ' в таком формате:\nЕсли 2 акции пишешь - "2", если 2,53 пишешь - "2.53")\n\n' \
                                     'БЕЗ КОВЫЧЕК и ЧЕРЕЗ ТОЧКУ ЕСЛИ НЕ ЦЕЛОЕ ЧИСЛО!'
delete_stock_info = 'У тебя в 💼 сейчас {shares} акций {symbol}.\n' \
                    'Ты действительно хочешь удалить этот Сток из своего портфолио?'
delete_stock_success = 'Ты успешно распрощался с {symbol} в твоем портфолио, надеюсь ты его выгодно продал 🙏'
delete_stock_cancel = 'Всё-таки не отторвал от сердца бусинку свою {symbol}, ничего позже скинешь' \
                      ' и больше наваришься, не переживай 🥸'
delete_stock_yes_text = 'Удалить 🗑'
delete_stock_no_text = 'Помиловать ❤️'

modify_balance_stock_shares_success = 'Обновили количесво акций!\nТеперь у тебя {shares} акций {stock}\n' \
                                      'А теперь введи сколько всего ты потратил на приобретение всех акций данного ' \
                                      'тикета?\n\n' \
                                      'Конечно же, в той валюте в которой ты указывал изначально и если хочешь считать' \
                                      ' до копеек то делай это через точку, пожалуйста.\n\n' \
                                      'Пример на всякий пожарный: 100 долларов и 27 центов - 100.27'
modify_balance_stock_total_costs_success = 'Обновили общее количество затраченных тобой средств на приобритение данных ' \
                                           'акций!\nТы затратил {total_costs} на приобретение {shares} акций {stock}\n'

change_to_invest_text = 'У тебя сейчас средст готовых к инвестиции: {to_invest}\n' \
                        'Какая должна быть новая сумма, сударь?'
changed_to_invest_text = 'Cупер! Я обновил твой баланс и теперь он равен: {to_invest}\n'


add_stock_symbol_check_already_have = 'Дурень, у тебя уже есть этот сток({symbol}) и целых {shares} акций в наличии.\n\n' \
                                      'Если хочешь - изменить его баланс то шуруй в меню изменений (кнопочка под' \
                                      ' портфолио "Поменять", а затем "✏️ Поменяем баланс️").'
add_stock_symbol_check_success = 'Мы с тобой успешно добавили новый сток {symbol} тебе в 💼.\n' \
                                 'Теперь напиши сколькими акциями ты обладаешь?\n\n(пиши цифрами ' \
                                 'в таком формате:\nЕсли 2 акции пишешь - "2", если 2,53 пишешь - "2.53")\n\n' \
                                 'БЕЗ КОВЫЧЕК и ЧЕРЕЗ ТОЧКУ ЕСЛИ НЕ ЦЕЛОЕ ЧИСЛО!'
add_stock_not_in_yfinance = 'Ну шо хочу сказать, либо еще ни на одной бирже такой сток не начал торговаться' \
                            ' - а ты жесткий инсайдер, либо ты шо-то не так написал..\n' \
                            'Чекни его наличие и как пишется его символ здесь и напиши' \
                            ' еще раз: https://finance.yahoo.com'






# дальше не трогаем

broadcast_command = '/broadcast'

broadcast_no_access = "Sorry, you don't have access to this function."
broadcast_header = "This message will be sent to all users.\n\n"
confirm_broadcast = "Confirm✅"
decline_broadcast = "Decline❌"
message_is_sent = "Message is sent✅\n\n"
declined_message_broadcasting = "Message broadcasting is declined❌\n\n"

error_with_markdown = "Can't parse your text in Markdown style."
specify_word_with_error = " You have mistake with the word "

secret_admin_commands = "⚠️ Secret Admin commands\n" \
                        "/stats - bot stats"

not_admin_answer = "You are not a admin!"

unlock_secret_room = "Congratulations! You've opened a secret room👁‍🗨. There is some information for you:\n" \
           "*Users*: {user_count}\n" \
           "*24h active*: {active_24}"

share_location = "Would you mind sharing your location?"
thanks_for_location = "Thanks for 🌏🌎🌍"

github_button_text = 'GitHub'
secret_level_button_text = 'Секретный уровень'